app/controllers/api/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    # @comment.username = current_user.username
    @comment.save!
---
INSERT INTO "comments" ("body", "dish_id", "user_id", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Yay!"], ["dish_id", 42], ["user_id", 10], ["username", "Rollin"], ["created_at", "2015-12-21 01:07:53.775690"], ["updated_at", "2015-12-21 01:07:53.775690"]]