app/controllers/api/dishes_controller.rb

  def index
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def show

    @dish = Dish.includes(:comments).includes(:images).find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."dish_id" = $1  [["dish_id", 37]]
SELECT "images".* FROM "images" WHERE "images"."dish_id" = $1  [["dish_id", 31]]

  def create
    # debugger
    @dish = Dish.new(dish_params)
    image_params.each { |image_publicid| @dish.images.build(url: image_publicid) }
    @dish.user_id = current_user.id
    # @dish.username = current_user.username
    @dish.save!
---
SELECT "images".* FROM "images" WHERE "images"."dish_id" = $1  [["dish_id", 32]]
INSERT INTO "dishes" ("name", "description", "user_id", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Banana?"], ["description", "You got a banana?"], ["user_id", 10], ["username", "Rollin"], ["created_at", "2015-12-21 01:18:39.092659"], ["updated_at", "2015-12-21 01:18:39.092659"]]
INSERT INTO "images" ("url", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def destroy
    @dish = Dish.find(params[:id])
    @dish.destroy
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 0]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 22]]