app/controllers/dishes_controller.rb

SELECT "dishes".* FROM "dishes"
---
  def index
    @dishes = Dish.all

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    @dish = Dish.find(params[:id])

INSERT INTO "dishes" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Cauliflower"], ["description", "Roasted and crispy"], ["user_id", 1], ["created_at", "2015-12-15 22:42:46.978201"], ["updated_at", "2015-12-15 22:42:46.978201"]]
---
  def create
    @dish = Dish.new(dish_params)
    @dish.user_id = current_user.id
    if @dish.save

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 4]]
---
  def edit
    @dish = Dish.find(params[:id])

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "dishes" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "dishes"."id" = $4  [["name", "cheeeese"], ["description", "melts in your mouth"], ["updated_at", "2015-12-15 23:32:25.845302"], ["id", 4]]
---
  def update
    @dish = Dish.find(params[:id])
    if @dish.update(dish_params)